meeting/minutes/2022/09-27.org
:PROPERTIES:
:ID:       C231C479-6247-468E-A9C7-5EA6E9D78155
:END:
#+title: QT4 CG Meeting 004 Minutes 2022-09-27
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showeverything

* Draft Minutes
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: minutes
:END:

* Summary of new and continuing actions [0/7]
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: new-actions
:END:

+ [ ] QT4CG-002-01: NW to incorporate email feedback and produce new
  versions of the process documents. 
+ [ ] QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on =-= characters.
+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-004-01: MK (with DN and RD) to draft a new proposal for variadic functions
+ [ ] QT4CG-004-02: DN to make a proposal for  =deep-equal-safe= for future discussion
+ [ ] QT4CG-004-03: MK to draft a pull request implementing =fn:intersperse=
+ [ ] QT4CG-004-04: DN to open an issue for the inverse of =fn:intersperse=

* Administrivia
:PROPERTIES:
:CUSTOM_ID: h-CF284F42-EB1E-4257-BF5F-AEB7129DB194
:END:

** Roll call [9/12]
:PROPERTIES:
:CUSTOM_ID: h-4CCBB41C-ED9C-4944-B6F3-F02A6470E209
:END:

Regrets: Bethan Tovey-Walsh

+ [ ] Anthony Bufort (AB)
+ [X] Reece Dunn (RD)
+ [X] Christian Grün (CG)
+ [X] Joel Kalvesmaki (JK)
+ [X] Michael Kay (MK)
+ [X] John Lumley (JL)
+ [X] Dimitre Novatchev (DN)
+ [X] Ed Porter (EP) [0:08-]
+ [ ] Liam Quin (LQ)
+ [X] C. M. Sperberg-McQueen (CSM)
+ [ ] Bethan Tovey-Walsh (BTW)
+ [X] Norm Tovey-Walsh (NW). /Chair/. /Scribe/.

** Accept the agenda
:PROPERTIES:
:CUSTOM_ID: agenda
:END:

Proposal: Accept [[../../agenda/2022/09-27.html][the agenda]] without amendments.

No objections.

** Next meeting
:PROPERTIES:
:CUSTOM_ID: h-42AC7180-0313-4CC0-8063-28F488D943F7
:END:

The next meeting [[../../agenda/2022/10-04.html][is scheduled for Tuesday, 4 October]]. Any regrets?

Regrets: JL

** Approve minutes of the previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Proposal: Accept [[../../minutes/2022/09-20.html][the minutes of the previous meeting]] as [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0047.html][amended]] on 20 September 2022 by MK.

No objections.

** Review of option action items [4/6]
:PROPERTIES:
:CUSTOM_ID: h-735AFFA8-69A5-4E59-B1BF-D3B65494FEE4
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-01: NW to incorporate email feedback and produce new
  versions of the process documents. 
+ [X] QT4CG-003-01: MK to find a way to specify =fn:characters()= more formally
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html
+ [X] QT4CG-003-02: MK to propose a reformulation of =fn:index-of()= in terms of =fn:index-where()=
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html
+ [ ] QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on =-= characters.
+ [X] QT4CG-003-04: MK to rename =fn:uniform()= and =fn:unique()= to =fn:all-equal()= and =fn:all-different()=, respectively
  + https://github.com/qt4cg/qtspecs/commit/f4b331869f0d75a5a706c01cc0655625fe065fa0 (see below)
+ [X] QT4CG-003-05: MK to consider how =fn:array-filter()= could be generalized to handle array predicates on the index as well as the value.
  + https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html

+ CSM: I think BTW had an action related to diversity that’s been lost.
+ NW: Indeed, I’m not sure I recorded that as an action. My apologies. I’ll add it to the list.

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: h-8BF0F2E9-11A2-4221-AAAD-00341B344DAC
:END:

** Approve proposed changes to fn:all and fn:some
:PROPERTIES:
:CUSTOM_ID: h-49C7D28D-15E6-41D4-8971-E9A1C9FB6917
:END:

Mike [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0023.html][completed]] his action. I’ve [[https://github.com/qt4cg/qtspecs/pull/152][republished the PR]] so that [[https://qt4cg.org/pr/152/xpath-functions-40/Overview.html#func-all][it builds]]
against the updated infrastructure.

Approved.

** Approve changes in ~changes-agreed-2022-09-20~ branch
:PROPERTIES:
:CUSTOM_ID: h-684E0659-9C9A-4344-BAAA-CB903FDFD94F
:END:

Mike created [[https://github.com/qt4cg/qtspecs/commit/f4b331869f0d75a5a706c01cc0655625fe065fa0][a branch]] which renames =fn:uniform()= and =fn:unique()= per his action 
QT4CG-003-04 and adds a few other editorial improvements.

Approved.

** XPath 4.0 functions
:PROPERTIES:
:CUSTOM_ID: h-E45C1EEA-F5B5-4856-8217-42D19A54A41C
:END:

