meeting/minutes/2022/09-27.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 004 Minutes 2022-09-27</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 004 Minutes 2022-09-27</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#minutes">Minutes</a></li>
<li><a href="#new-actions">Summary of new and continuing actions <code>[0/7]</code></a></li>
<li><a href="#h-CF284F42-EB1E-4257-BF5F-AEB7129DB194">1. Administrivia</a>
<ul>
<li><a href="#h-4CCBB41C-ED9C-4944-B6F3-F02A6470E209">1.1. Roll call <code>[9/12]</code></a></li>
<li><a href="#agenda">1.2. Accept the agenda</a></li>
<li><a href="#h-42AC7180-0313-4CC0-8063-28F488D943F7">1.3. Next meeting</a></li>
<li><a href="#approve-minutes">1.4. Approve minutes of the previous meeting</a></li>
<li><a href="#h-735AFFA8-69A5-4E59-B1BF-D3B65494FEE4">1.5. Review of option action items <code>[4/6]</code></a></li>
</ul>
</li>
<li><a href="#h-8BF0F2E9-11A2-4221-AAAD-00341B344DAC">2. Technical Agenda</a>
<ul>
<li><a href="#h-49C7D28D-15E6-41D4-8971-E9A1C9FB6917">2.1. Approve proposed changes to fn:all and fn:some</a></li>
<li><a href="#h-684E0659-9C9A-4344-BAAA-CB903FDFD94F">2.2. Approve changes in <code>changes-agreed-2022-09-20</code> branch</a></li>
<li><a href="#h-E45C1EEA-F5B5-4856-8217-42D19A54A41C">2.3. XPath 4.0 functions</a>
<ul>
<li><a href="#h-19F083AF-29AB-4414-A742-ABAB0B2FA2E6">2.3.1. Variadic functions</a></li>
<li><a href="#h-713E25B3-12C4-4872-8ECF-1371440CED18">2.3.2. Move <code>fn:deep-equal</code> higher up the list?</a></li>
<li><a href="#h-FB9EC79F-3BC4-42D8-9935-3BF136689C23">Returning to the list of functions…</a></li>
<li><a href="#h-9183C2F7-C04B-4E31-BEE6-B95C0CECFDE0">2.3.3. fn:intersperse</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#any-other-business">3. Any other business</a></li>
</ul>
</div>
</div>

<div id="outline-container-minutes" class="outline-2">
<h2 id="minutes">Minutes</h2>
<div class="outline-text-2" id="text-minutes">
<p>
Approved <a href="./10-04.html">at meeting 005</a> on 4 October 2022.
</p>
</div>
</div>

<div id="outline-container-new-actions" class="outline-2">
<h2 id="new-actions">Summary of new and continuing actions <code>[0/7]</code></h2>
<div class="outline-text-2" id="text-new-actions">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-01: NW to incorporate email feedback and produce new
versions of the process documents.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on <code>-</code> characters.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-004-01: MK (with DN and RD) to draft a new proposal for variadic functions</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-004-02: DN to make a proposal for  <code>deep-equal-safe</code> for future discussion</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-004-03: MK to draft a pull request implementing <code>fn:intersperse</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-004-04: DN to open an issue for the inverse of <code>fn:intersperse</code></li>
</ul>
</div>
</div>

<div id="outline-container-h-CF284F42-EB1E-4257-BF5F-AEB7129DB194" class="outline-2">
<h2 id="h-CF284F42-EB1E-4257-BF5F-AEB7129DB194"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-h-CF284F42-EB1E-4257-BF5F-AEB7129DB194">
</div>

<div id="outline-container-h-4CCBB41C-ED9C-4944-B6F3-F02A6470E209" class="outline-3">
<h3 id="h-4CCBB41C-ED9C-4944-B6F3-F02A6470E209"><span class="section-number-3">1.1.</span> Roll call <code>[9/12]</code></h3>
<div class="outline-text-3" id="text-h-4CCBB41C-ED9C-4944-B6F3-F02A6470E209">
<p>
Regrets: Bethan Tovey-Walsh
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Anthony Bufort (AB)</li>
<li class="on"><code>[X]</code> Reece Dunn (RD)</li>
<li class="on"><code>[X]</code> Christian Grün (CG)</li>
<li class="on"><code>[X]</code> Joel Kalvesmaki (JK)</li>
<li class="on"><code>[X]</code> Michael Kay (MK)</li>
<li class="on"><code>[X]</code> John Lumley (JL)</li>
<li class="on"><code>[X]</code> Dimitre Novatchev (DN)</li>
<li class="on"><code>[X]</code> Ed Porter (EP) [0:08-]</li>
<li class="off"><code>[&#xa0;]</code> Liam Quin (LQ)</li>
<li class="on"><code>[X]</code> C. M. Sperberg-McQueen (CSM)</li>
<li class="off"><code>[&#xa0;]</code> Bethan Tovey-Walsh (BTW)</li>
<li class="on"><code>[X]</code> Norm Tovey-Walsh (NW). <i>Chair</i>. <i>Scribe</i>.</li>
</ul>
</div>
</div>

<div id="outline-container-agenda" class="outline-3">
<h3 id="agenda"><span class="section-number-3">1.2.</span> Accept the agenda</h3>
<div class="outline-text-3" id="text-agenda">
<p>
Proposal: Accept <a href="../../agenda/2022/09-27.html">the agenda</a> without amendments.
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-h-42AC7180-0313-4CC0-8063-28F488D943F7" class="outline-3">
<h3 id="h-42AC7180-0313-4CC0-8063-28F488D943F7"><span class="section-number-3">1.3.</span> Next meeting</h3>
<div class="outline-text-3" id="text-h-42AC7180-0313-4CC0-8063-28F488D943F7">
<p>
The next meeting <a href="../../agenda/2022/10-04.html">is scheduled for Tuesday, 4 October</a>. Any regrets?
</p>

<p>
Regrets: JL
</p>
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.4.</span> Approve minutes of the previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Proposal: Accept <a href="../../minutes/2022/09-20.html">the minutes of the previous meeting</a> as <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0047.html">amended</a> on 20 September 2022 by MK.
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-h-735AFFA8-69A5-4E59-B1BF-D3B65494FEE4" class="outline-3">
<h3 id="h-735AFFA8-69A5-4E59-B1BF-D3B65494FEE4"><span class="section-number-3">1.5.</span> Review of option action items <code>[4/6]</code></h3>
<div class="outline-text-3" id="text-h-735AFFA8-69A5-4E59-B1BF-D3B65494FEE4">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-01: NW to incorporate email feedback and produce new
versions of the process documents.</li>
<li class="on"><code>[X]</code> QT4CG-003-01: MK to find a way to specify <code>fn:characters()</code> more formally
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0044.html</a></li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-003-02: MK to propose a reformulation of <code>fn:index-of()</code> in terms of <code>fn:index-where()</code>
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0045.html</a></li>
</ul></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-003-03: NW to tweak the CSS for function signatures to avoid line breaks on <code>-</code> characters.</li>
<li class="on"><code>[X]</code> QT4CG-003-04: MK to rename <code>fn:uniform()</code> and <code>fn:unique()</code> to <code>fn:all-equal()</code> and <code>fn:all-different()</code>, respectively
<ul class="org-ul">
<li><a href="https://github.com/qt4cg/qtspecs/commit/f4b331869f0d75a5a706c01cc0655625fe065fa0">https://github.com/qt4cg/qtspecs/commit/f4b331869f0d75a5a706c01cc0655625fe065fa0</a> (see below)</li>
</ul></li>
<li class="on"><code>[X]</code> QT4CG-003-05: MK to consider how <code>fn:array-filter()</code> could be generalized to handle array predicates on the index as well as the value.
<ul class="org-ul">
<li><a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html">https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0046.html</a></li>
</ul></li>

<li>CSM: I think BTW had an action related to diversity that’s been lost.</li>
<li>NW: Indeed, I’m not sure I recorded that as an action. My apologies. I’ll add it to the list.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-h-8BF0F2E9-11A2-4221-AAAD-00341B344DAC" class="outline-2">
<h2 id="h-8BF0F2E9-11A2-4221-AAAD-00341B344DAC"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-h-8BF0F2E9-11A2-4221-AAAD-00341B344DAC">
</div>

<div id="outline-container-h-49C7D28D-15E6-41D4-8971-E9A1C9FB6917" class="outline-3">
<h3 id="h-49C7D28D-15E6-41D4-8971-E9A1C9FB6917"><span class="section-number-3">2.1.</span> Approve proposed changes to fn:all and fn:some</h3>
<div class="outline-text-3" id="text-h-49C7D28D-15E6-41D4-8971-E9A1C9FB6917">
<p>
Mike <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0023.html">completed</a> his action. I’ve <a href="https://github.com/qt4cg/qtspecs/pull/152">republished the PR</a> so that <a href="https://qt4cg.org/pr/152/xpath-functions-40/Overview.html#func-all">it builds</a>
against the updated infrastructure.
</p>

<p>
Approved.
</p>
</div>
</div>

<div id="outline-container-h-684E0659-9C9A-4344-BAAA-CB903FDFD94F" class="outline-3">
<h3 id="h-684E0659-9C9A-4344-BAAA-CB903FDFD94F"><span class="section-number-3">2.2.</span> Approve changes in <code>changes-agreed-2022-09-20</code> branch</h3>
<div class="outline-text-3" id="text-h-684E0659-9C9A-4344-BAAA-CB903FDFD94F">
<p>
Mike created <a href="https://github.com/qt4cg/qtspecs/commit/f4b331869f0d75a5a706c01cc0655625fe065fa0">a branch</a> which renames <code>fn:uniform()</code> and <code>fn:unique()</code> per his action 
QT4CG-003-04 and adds a few other editorial improvements.
</p>

<p>
Approved.
</p>
</div>
</div>

<div id="outline-container-h-E45C1EEA-F5B5-4856-8217-42D19A54A41C" class="outline-3">
<h3 id="h-E45C1EEA-F5B5-4856-8217-42D19A54A41C"><span class="section-number-3">2.3.</span> XPath 4.0 functions</h3>
<div class="outline-text-3" id="text-h-E45C1EEA-F5B5-4856-8217-42D19A54A41C">
</div>
