meeting/minutes/2022/09-27.html

<div id="outline-container-h-19F083AF-29AB-4414-A742-ABAB0B2FA2E6" class="outline-4">
<h4 id="h-19F083AF-29AB-4414-A742-ABAB0B2FA2E6"><span class="section-number-4">2.3.1.</span> Variadic functions</h4>
<div class="outline-text-4" id="text-h-19F083AF-29AB-4414-A742-ABAB0B2FA2E6">
<p>
Dimitre <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Sep/0076.html">proposes</a> that we should discuss variadic functions sooner rather than later:
</p>

<blockquote>
<p>
“WRT our dependency sorting, can we discuss with high priority and
approve the XPath 4.0 variadic functions, so that immediately after
that we could typically describe not N overloads of a proposed
function, but just a single signature containing keyword arguments
with defaults?”
</p>
</blockquote>

<ul class="org-ul">
<li>CSM: I think we should talk about it, but I doubt we’re ready to
make a decision. Mostly, at the moment, I want to raise a deeper
question: are we sure we want to do this? I’m nervous because there
was a time when the QT WGs had multiple people who spent their
careers doing type theory, and we didn’t do it then. Are we sure we
have the necessary experience to avoid the pitfalls?</li>
<li>RD: I do have a working implementation of the variadic function
calls, mapping function arguments to function parameters. That’s
implementing the current spec plus one the issues that I raised
around that…# (separating the variadic type from …)</li>
<li>MK: I think caution is absolutely justified. It occurred to me this
morning, trying to do my revised way of presenting the design, that
one thing that’s badly lacking so far is the substitutability rules.
Let’s go back to why we’re trying to do this?
<ul class="org-ul">
<li>The primary aim is to make the functions we already have more
extensible. Doing it by always adding more isn’t always what you
want.</li>
<li>The “options map” option was introduced in 3.1 and a lot of folks
think that could be more useful with keyword parameters.</li>
<li>There are good motivations for wanting to do it, but I share CSM’s
concern about the potential complexity. We fell into type theory
traps in 3.1 and we have bugs in the spec.</li>
</ul></li>
<li>JL: Do you have an example?</li>
<li>MK: Yes, I forget exactly where it is, but we talk about the type of
a map when considered as a function and we talk about having the
“least common type” of two types, and that phrase is used glibly
without realizing that our type system doesn’t have that concept.</li>
<li>JL: The hardest thing I recall in the later stages of SaxonJS was
substituting functions. Everything gets turned upside down and
adding variadic seems really tricky.</li>
<li>RD: In terms of named keywords, one of the cases where that is
useful is if you have three or four boolean parameters. Having names
allows you to know exactly which things are “true”, “true”, and
“false” for example. Constructing a map and passing it into a
function call can be complicated where passing them on the function
would be easy.</li>
<li>CSM: Sanity check, I think based on my reading of the proposal, that
if I have three parameters all of them declared single, booleans. I
can use their parameter names as keywords: a=true, b=true, c=false,
in whatever order is rhetorically best at the point of call. I
haven’t quite got my head around optionality and keyword parameters.</li>
<li>MK: I think optional parameters are relatively low risk. It’s the
truely variadic ones that create potential complexity.</li>
<li>RD: That’s the ones that bind a sequence to a set of parameters&#x2026;</li>
<li>MK: Yes.</li>
<li>DM: I think this proposal stemmed from a conversation that I had
with Mike in chat. I was thinking only keyword parameters, which
seem low risk. We should focus on the challenging things.
<ul class="org-ul">
<li>The benefits of having this as early as possible in our process is
very large. This can lead to significant simplification of the
documents. We can avoid the need to have many different function
signatures.</li>
</ul></li>
<li>RD: I wonder if it makes sense to divide this up a bit, rather than
tackling all at once.
<ul class="org-ul">
<li>The initial goal that DN brought this up for was specifying
default parameters on functions to reduce the complexity in the
F&amp;O spec. That would require bounded variadic functions which keep
the functionality between an upper- and lower-bound with specified
defaults.</li>
<li>And we could allow keyword arguments.</li>
</ul></li>
<li>I don’t think that adds anything to the type system. At some point
in the future, we can look at how to apply these to sequence types
and map types.</li>
<li>NW: If we can decompose the problem into smaller pieces, that’s a good thing.</li>
<li>MK: That sounds like a good idea to me.</li>
<li>RD: We can always add things in the future.</li>
<li>MK: One question, particularly of Dimitre. Do we want keyword
parameters on dynamic function calls?</li>
<li>DN: I think that’s an extremely good question. It only matters if we
define a dynamic function and then we have a large scope where we
use that function. If there are a lot of calls to that function,
then it would be helpful to users. I’m not ready to say “yes” very
firmly, but I do see use cases where it can be useful.</li>
<li>MK: I think its a lot more difficult to define things like partial
function application if we need to do it in the dynamic case.</li>
</ul>

<div class="CHAT" id="org93a7f44">
<p>
(Some discussion of “boundedness” and “unboundedness in Zoom chat.)
</p>

<ul class="org-ul">
<li>CSM: Keyword parameters do help deal with functions with lots of
parameters &#x2013; but I worry that it's just attempting to evade
Perlis's maxim that "if you have a function with ten parameters, you
probably missed one"</li>
<li>CSM: Q. I am not finding the words "bounded" and "unbounded" in MK's proposal.  Meaning?</li>
<li>CG: I assume that fn:concat is an example for a function with an
unbounded number of maximum arguments. Some more details are given
in the current version of the draft:</li>
</ul>

</div>

<ul class="org-ul">
<li>MK: The terms appear not in my email of this morning, but in the
original proposal. In this morning’s proposal, I attributed a
plurality to each of the arguments. A bounded variadic function is
basically one that has single and optional arguments, but doesn’t
have multiples or maps.</li>
<li>JL: Is <code>concat</code> the only function we have with multiple, unbounded
arguments?</li>
<li>RD: That’s the only one in the spec, but other implementors have
tried to generalize the idea in other functions. BaseX <code>out-format</code>
is variadic, so is <code>allow</code>, and the XQuery <code>rest-consumes</code>, etc…
Various MarkLogic functions are also variadic.</li>
<li>MK: In this area, it’s an awful lot easier to do something in an
implementation than it is in a specification.</li>
<li>NW: Does it make sense to come back with new drafts for just the parts</li>
<li>JK: Much of the proposal is written from the perspective parsing and
understanding a function. It would be nice to have some discussion
of whether or not function authors are going to have to think about
things differently.</li>
<li>MK: In a lot of existing function libraries, there’s some
possibility that users will discover that they wish they’d chosen
better names. Those are now going to be public where they’d
previously been private.</li>
<li>RD: The way the draft is currently specified, function authors won’t
have to change the order of things to make things variadic.
Variadicness applies to the last argument. If the last parameter is
a map, you can use the map keys. If the last parameter is a
sequence, you can zero or one or more arguemnts.</li>
<li>CSM: I think we now have two examples of the utility of what JK
suggests. Correct me if I’m wrong, you’re not limited to a single
map or multiple parameters. That’s the idiom I’m familiar with, but
in the proposal before us, the only constraint is that if I have
more than multiple/map; if I want to reach any of them except the
first declared, I have to use keyword. But if I use keywords, I can
have an arbitrary number of them.</li>
<li>MK: No, that’s not quite the proposal. In the language of this
mornings proposal, you can have zero or one multiple parameters and
zero or one mapped parameters. You can have zero or more single or
optional parameters.</li>
<li>CSM: Thank you. I just misread the paragraph.</li>
<li>RD: I’m basing my comments on the proposal that’s actually in the
current spec; I’ve only read MK’s proposal briefly. It would be good
to have a more formal proposal.</li>
<li>DN: I’ve missed this morning’s proposal, but can I propose that at
first we concentrate on adding variadic bounded functions. I think
that’s an easier case.</li>
</ul>

<p>
ACTION QT4CG-004-01: MK (with DN and RD) to draft a new proposal for variadic functions
</p>
</div>
</div>
