meeting/minutes/2022/09-27.org
*** Move ~fn:deep-equal~ higher up the list?
:PROPERTIES:
:CUSTOM_ID: h-713E25B3-12C4-4872-8ECF-1371440CED18
:END:

Dimitre observes “some of the functions to be discussed that are included in the
current list/checklist, depend on using a compare() function /
strategy. This makes all of them dependent on having first discussed
and approved fn:deep-equal(options). Therefore, could we move
fn:deep-equal(options) considerably higher in the list, so that it
precedes all such functions that are dependent on a compare()
function/strategy?”

+ DN: There are a number of functions higher in the list that can take
  different kinds of comparisons (sequence starts with, contains,
  etc.) They can use different comparison functions. While we can
  generally say that people can specify any comparison function they
  want, MK and I discussed a lot about what could be a good comparison function.
  + It seems like some options on =fn:deep-equal= could be a good way
    to go to reach consensus on such a function.
+ MK: I have no objection to working on deep-equal sooner, but we
  don’t have a proposal to discuss at the moment.
+ DN: This is related to allowing any items as keys of maps. I
  constructed =deep-equal-safe= in the comments to this proposal. That could possibly be regarded as a starting point.

ACTION QT4CG-004-02: DN to make a proposal for  =deep-equal-safe= for future discussion

*** Returning to the list of functions…
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: h-FB9EC79F-3BC4-42D8-9935-3BF136689C23
:END:

+ MK: I’d like to look at the order of the functions on the agenda;
  some have fairly well formulated proposals, we should start with
  those.

MK proposes starting with =fn:intersperse=.

No objections.

*** fn:intersperse
:PROPERTIES:
:CUSTOM_ID: h-9183C2F7-C04B-4E31-BEE6-B95C0CECFDE0
:END:
+ See https://github.com/qt4cg/qtspecs/issues/2

+ MK: I think it would be useful to show a sample implementation for a
  bit more rigorous definition. There are a couple in the comment.
+ CSM: I’m not sure I understand the function. We have examples of how
  to call it, but I don’t see an explicit statement of what gets
  return. The analogy with =string-join= makes me nervous. 
+ DN: The separator can be any sequence, not just an item.
+ DN: I have a question about the name, =intersperse= carries connotations of randomness.
+ MK: If it’s in other languages, that’s good enough.
+ CG: It’s in Haskell and Dart.
+ DN: What about the reverse? Splitting on a sequence?
+ RD: It’s more like “take ‘n’ drop ‘k’ repeat.”
+ CSM: I like, in general, the idea of having an inverse if you can specify it.

Chair interrupts the discussion of the inverse function to get clarity on the proposal.

Proposal: Accept =fn:intersperse=

No objections.

ACTION QT4CG-004-03: MK to draft a pull request implementing =fn:intersperse=

+ RD: I think it’s straightfoward to implement the inverse because
  you’re applying a collect to collect one plus the number of
  interspersed items.
+ NW: That’s more clever than I am…
+ CSM: You have to check that the ones you’re removing match the thing
  that was inserted.
+ RD: It would have to be that you can’t do anything between
  intersperse and the inverse, otherwise you’re going to tie yourself
  into knots.
+ NW: It seems more like a “split on matching subsequences” function
  to me, and how does the result get returned anyway, given that we
  don’t have sequences of sequences?
+ DN: It could return it in an array and we probably need an analogous function to intersperse arrays.
+ JK: I think the inverse function might get really complicated with
  exceptions and error handling. The analogy to =string-join= is
  helpful here, the inverse would be like =tokenize=.
+ CG: I was wondering if we have a practical use case for such a
  function, there’s nothing like this in Haskell and Dart.
+ DN: Consider the case where a function takes a single string and the
  first thing the function does is tokenize that string. Similar use
  cases probably exist for this function.
+ RD: Would CSV parsing be a use ase? Tokenize on newlines and…

With time running short, the chair proposes that DN take an action.

ACTION QT4CG-004-04: DN to open an issue for the inverse of =fn:intersperse=

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

None heard.
