meeting/minutes/2022/09-27.html

<div id="outline-container-h-713E25B3-12C4-4872-8ECF-1371440CED18" class="outline-4">
<h4 id="h-713E25B3-12C4-4872-8ECF-1371440CED18"><span class="section-number-4">2.3.2.</span> Move <code>fn:deep-equal</code> higher up the list?</h4>
<div class="outline-text-4" id="text-h-713E25B3-12C4-4872-8ECF-1371440CED18">
<p>
Dimitre observes “some of the functions to be discussed that are included in the
current list/checklist, depend on using a compare() function /
strategy. This makes all of them dependent on having first discussed
and approved fn:deep-equal(options). Therefore, could we move
fn:deep-equal(options) considerably higher in the list, so that it
precedes all such functions that are dependent on a compare()
function/strategy?”
</p>

<ul class="org-ul">
<li>DN: There are a number of functions higher in the list that can take
different kinds of comparisons (sequence starts with, contains,
etc.) They can use different comparison functions. While we can
generally say that people can specify any comparison function they
want, MK and I discussed a lot about what could be a good comparison function.
<ul class="org-ul">
<li>It seems like some options on <code>fn:deep-equal</code> could be a good way
to go to reach consensus on such a function.</li>
</ul></li>
<li>MK: I have no objection to working on deep-equal sooner, but we
don’t have a proposal to discuss at the moment.</li>
<li>DN: This is related to allowing any items as keys of maps. I
constructed <code>deep-equal-safe</code> in the comments to this proposal. That could possibly be regarded as a starting point.</li>
</ul>

<p>
ACTION QT4CG-004-02: DN to make a proposal for  <code>deep-equal-safe</code> for future discussion
</p>
</div>
</div>

<div id="outline-container-h-FB9EC79F-3BC4-42D8-9935-3BF136689C23" class="outline-4">
<h4 id="h-FB9EC79F-3BC4-42D8-9935-3BF136689C23">Returning to the list of functions…</h4>
<div class="outline-text-4" id="text-h-FB9EC79F-3BC4-42D8-9935-3BF136689C23">
<ul class="org-ul">
<li>MK: I’d like to look at the order of the functions on the agenda;
some have fairly well formulated proposals, we should start with
those.</li>
</ul>

<p>
MK proposes starting with <code>fn:intersperse</code>.
</p>

<p>
No objections.
</p>
</div>
</div>

<div id="outline-container-h-9183C2F7-C04B-4E31-BEE6-B95C0CECFDE0" class="outline-4">
<h4 id="h-9183C2F7-C04B-4E31-BEE6-B95C0CECFDE0"><span class="section-number-4">2.3.3.</span> fn:intersperse</h4>
<div class="outline-text-4" id="text-h-9183C2F7-C04B-4E31-BEE6-B95C0CECFDE0">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/2">https://github.com/qt4cg/qtspecs/issues/2</a></li>

<li>MK: I think it would be useful to show a sample implementation for a
bit more rigorous definition. There are a couple in the comment.</li>
<li>CSM: I’m not sure I understand the function. We have examples of how
to call it, but I don’t see an explicit statement of what gets
return. The analogy with <code>string-join</code> makes me nervous.</li>
<li>DN: The separator can be any sequence, not just an item.</li>
<li>DN: I have a question about the name, <code>intersperse</code> carries connotations of randomness.</li>
<li>MK: If it’s in other languages, that’s good enough.</li>
<li>CG: It’s in Haskell and Dart.</li>
<li>DN: What about the reverse? Splitting on a sequence?</li>
<li>RD: It’s more like “take ‘n’ drop ‘k’ repeat.”</li>
<li>CSM: I like, in general, the idea of having an inverse if you can specify it.</li>
</ul>

<p>
Chair interrupts the discussion of the inverse function to get clarity on the proposal.
</p>

<p>
Proposal: Accept <code>fn:intersperse</code>
</p>

<p>
No objections.
</p>

<p>
ACTION QT4CG-004-03: MK to draft a pull request implementing <code>fn:intersperse</code>
</p>

<ul class="org-ul">
<li>RD: I think it’s straightfoward to implement the inverse because
you’re applying a collect to collect one plus the number of
interspersed items.</li>
<li>NW: That’s more clever than I am…</li>
<li>CSM: You have to check that the ones you’re removing match the thing
that was inserted.</li>
<li>RD: It would have to be that you can’t do anything between
intersperse and the inverse, otherwise you’re going to tie yourself
into knots.</li>
<li>NW: It seems more like a “split on matching subsequences” function
to me, and how does the result get returned anyway, given that we
don’t have sequences of sequences?</li>
<li>DN: It could return it in an array and we probably need an analogous function to intersperse arrays.</li>
<li>JK: I think the inverse function might get really complicated with
exceptions and error handling. The analogy to <code>string-join</code> is
helpful here, the inverse would be like <code>tokenize</code>.</li>
<li>CG: I was wondering if we have a practical use case for such a
function, there’s nothing like this in Haskell and Dart.</li>
<li>DN: Consider the case where a function takes a single string and the
first thing the function does is tokenize that string. Similar use
cases probably exist for this function.</li>
<li>RD: Would CSV parsing be a use ase? Tokenize on newlines and…</li>
</ul>

<p>
With time running short, the chair proposes that DN take an action.
</p>

<p>
ACTION QT4CG-004-04: DN to open an issue for the inverse of <code>fn:intersperse</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
<p>
None heard.
</p>
</div>
</div>
</div>
</body>
</html>
